Map<String, Map<String, String>> currencyDatabases = {
  "الجنيه المصري": {
    "1": "واحد جنيه",
    "5": "خمسة جنيهات",
    "10": "عشرة جنيهات",
    "20": "عشرون جنيهاً",
    "50": "خمسون جنيهاً",
    "100": "مئة جنيه",
    "200": "مئتان جنيه",
  },
  "الريال اليمني": {
    "100": "مئة ريال",
    "200": "مئتان ريال",
    "500": "خمسمئة ريال",
    "1000": "ألف ريال",
  },
  "الدولار الأمريكي": {
    "1": "واحد دولار",
    "5": "خمسة دولارات",
    "10": "عشرة دولارات",
    "20": "عشرون دولاراً",
    "50": "خمسون دولاراً",
    "100": "مئة دولار",
  },
  "الريال السعودي": {
    // تم إضافة الريال السعودي
    "1": "واحد ريال سعودي",
    "5": "خمسة ريالات سعودي",
    "10": "عشرة ريالات سعودي",
    "50": "خمسون ريالاً سعودي",
    "100": "مئة ريال سعودي",
    "500": "خمسمئة ريال سعودي",
  },
};
